const a = +prompt('Введіть, будь ласка, перше число');
const b = +prompt('Введіть, будь ласка, друге число');

const numberA = a % b;

if (numberA === 0) {
    alert('Число' + ' ' + a + ' ' + 'є дільником числа' + ' ' + b);
} else {
    alert('Число' + ' ' + a + ' ' + 'не є дільником числа' + ' ' + b);
}

const numberB = b % a;

if (numberB === 0) {
    alert('Число' + ' ' + b + ' ' + 'є дільником числа' + ' ' + a);
} else {
    alert('Число' + ' ' + b + ' ' + 'не є дільником числа' + ' ' + a);
}
